tutorials/multiphase/cavitatingFoam/ras/throttle/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

interpolationSchemes
{
    default         linear;
}

divSchemes
{
    default         none;
    div(phi,rho)    Gauss limitedLinear 1;
    div(rhoPhi,U)   Gauss limitedLinearV 1;
    div(phi,omega)  Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div((muEff*dev(T(grad(U))))) Gauss linear;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         none;
    p               ;
    rho             ;
}


// ************************************************************************* //
